In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r'E:\machine learning coaching\titanic project\titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
df.shape

(891, 12)

In [6]:
df.drop(['Name','Ticket','Cabin','PassengerId'],axis=1,inplace=True)

In [7]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [8]:
df['Embarked'].fillna(df['Embarked'].mode()[0],inplace=True)

In [9]:
df['Age'].fillna(df['Age'].mode()[0],inplace=True)

In [10]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [11]:
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [12]:
df['Embarked']=df['Embarked'].map({'S':0, 'C':1, 'Q':2})

In [13]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    male  22.0      1      0   7.2500         0
1         1       1  female  38.0      1      0  71.2833         1
2         1       3  female  26.0      0      0   7.9250         0
3         1       1  female  35.0      1      0  53.1000         0
4         0       3    male  35.0      0      0   8.0500         0

In [14]:
dfs=pd.get_dummies(df['Sex'])

In [15]:
dfs

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [16]:
dft=pd.concat([df,dfs],axis=1)

In [17]:
dft.drop('Sex',axis=1,inplace=True)

In [18]:
dft.head()

   Survived  Pclass   Age  SibSp  Parch     Fare  Embarked  female  male
0         0       3  22.0      1      0   7.2500         0       0     1
1         1       1  38.0      1      0  71.2833         1       1     0
2         1       3  26.0      0      0   7.9250         0       1     0
3         1       1  35.0      1      0  53.1000         0       1     0
4         0       3  35.0      0      0   8.0500         0       0     1

In [19]:
dft.describe()

,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked,female,male
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,0.383838,2.308642,28.566970,0.523008,0.381594,32.204208,0.361392,0.352413,0.647587
std,0.486592,0.836071,13.199572,1.102743,0.806057,49.693429,0.635673,0.477990,0.477990
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400,0.000000,0.000000,0.000000
50%,0.000000,3.000000,24.000000,0.000000,0.000000,14.454200,0.000000,0.000000,1.000000
75%,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000,1.000000,1.000000,1.000000
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,2.000000,1.000000,1.000000

In [20]:
dft.corr()

,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked,female,male
Survived,1.000000,-0.338481,-0.052872,-0.035322,0.081629,0.257307,0.106811,0.543351,-0.543351
Pclass,-0.338481,1.000000,-0.356187,0.083081,0.018443,-0.549500,0.045702,-0.131900,0.131900
Age,-0.052872,-0.356187,1.000000,-0.232411,-0.155118,0.107554,-0.047625,-0.073377,0.073377
SibSp,-0.035322,0.083081,-0.232411,1.000000,0.414838,0.159651,-0.059961,0.114631,-0.114631
Parch,0.081629,0.018443,-0.155118,0.414838,1.000000,0.216225,-0.078665,0.245489,-0.245489
Fare,0.257307,-0.549500,0.107554,0.159651,0.216225,1.000000,0.062142,0.182333,-0.182333
Embarked,0.106811,0.045702,-0.047625,-0.059961,-0.078665,0.062142,1.000000,0.116569,-0.116569
female,0.543351,-0.131900,-0.073377,0.114631,0.245489,0.182333,0.116569,1.000000,-1.000000
male,-0.543351,0.131900,0.073377,-0.114631,-0.245489,-0.182333,-0.116569,-1.000000,1.000000

In [21]:
df_final=dft.iloc[:,2:]

In [22]:
df_final.head()

    Age  SibSp  Parch     Fare  Embarked  female  male
0  22.0      1      0   7.2500         0       0     1
1  38.0      1      0  71.2833         1       1     0
2  26.0      0      0   7.9250         0       1     0
3  35.0      1      0  53.1000         0       1     0
4  35.0      0      0   8.0500         0       0     1

In [23]:
x=df_final.values
y=dft.Survived.values

In [24]:
from sklearn.model_selection import train_test_split

In [25]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=.2,random_state=8)

In [26]:
from sklearn.linear_model import LogisticRegression

In [27]:
lr=LogisticRegression()

In [28]:
lr.fit(x_train,y_train)

LogisticRegression()

In [30]:
x_train_prediction = lr.predict(x_train)

In [32]:
from sklearn.metrics import accuracy_score

In [33]:
training_data_accuracy = accuracy_score(y_train, x_train_prediction)
print('Accuracy score of training data : ', training_data_accuracy)

Accuracy score of training data :  0.8061797752808989

In [34]:
import pickle

In [35]:
f = open('titanic.pkl','wb')
pickle.dump(lr,f)
f.close()

In [36]:
f = open('titanic.pkl','rb')
lr = pickle.load(f)
f.close()

In [38]:
sample=df_final[9:10]

In [39]:
sample

    Age  SibSp  Parch     Fare  Embarked  female  male
9  14.0      1      0  30.0708         1       1     0

In [40]:
sampledata=np.asarray(sample)

In [42]:
sampledata_reshaped = sampledata.reshape(1,-1)

In [43]:
predict=lr.predict(sampledata_reshaped)
if predict[0]==0:
    print('dead')
if predict[0]==1:
    print('alive')

alive